Geografi Vol. (5), No. (2) Special Issue, (2017), 8-22 
     © Penerbit Universiti Pendidikan Sultan Idris 2017 
      ISSN 2289-4470 /eISSN 2462-2400 
Focus editor special issue - Dr Rosniza Aznie Che Rose 
 
Kualiti Hidup Peserta Program Ladang Kontrak di Bawah Pertubuhan Peladang 
Kawasan 
The Quality of Life among Contract Farming Programme Participants under Local Farmers Association 
Rosniza Aznie Che Rose*& Tee Meng Yong 
Fakulti Sains Sosial dan Kemanusiaan,  
Universiti Kebangsaan Malaysia, 43600 Bangi, Selangor 
*
emel: aznie@ukm.edu.my 
 
Received: 7 August 2017; Accepted: 6 October 2017; Published: 31 December 2017 
 
Abstrak 
Kajian ini dilakukan untuk mengenal pasti sumbangan Pertubuhan Peladang Kawasan (PPK) dan tahap penyertaan 
peserta PPK dalam program ladang kontrak di Selangor Darul Ehsan. Kerangka kajian berdasarkan kepada dua teori 
utama iaitu gabungan tipologi Pretty dan model Arnstein yang digunakan untuk mengkaji tahap penglibatan peserta 
program ladang kontrak dan sumbangan-sumbangan PPK dalam ladang kontrak. Persampelan mudah dipilih dalam 
pelaksanaan kajian ini yang melibatkan seramai 108 daripada 145 jumlah keseluruhan peserta program ladang kontrak 
di bawah PPK. Walau bagaimanapun, daripada 108 borang soal selidik yang diedarkan hanya 98 jawapan responden 
yang diterima. Hasil kajian menunjukkan bahawa PPK bawah program ladang kontrak ternyata dapat meningkatkan 
kualiti hidup peserta dari aspek pendapatan dan pengagihan, pendidikan, kesihatan dan keluarga dengan sumbangan-
sumbangan PPK yang dikenal pasti berada dalam lingkungan 82.7 hingga 91.8 peratus. Sementara itu, tahap 
penyertaan peserta PPK di bawah program ladang kontrak boleh dikatakan pada tahap penglibatan akar umbi dan agak 
memberangsangkan. Penglibatan yang berada pada tahap tinggi adalah penglibatan berfungsi, penglibatan interaktif 
dan penglibatan pergerakan sendiri. Ini sejajar dengan peringkat kuasa komuniti (citizen power) dalam model Arnstein 
di mana peserta mempunyai kuasa penuh ke atas penglibatan. Lanjutan daripada itu, dengan memahami sumbangan 
PPK dan tahap penyertaan peserta PPK di kawasan kajian, Kementerian Pertanian dan Industri Asas Tani serta 
jabatan/agensi di bawahnya dapat melakukan penambahbaikan dalam memastikan pelaksanaan program ladang 
kontrak ini benar-benar mencapai sasaran dan golongan sasaran. 
Kata kunci kualiti hidup, Pertubuhan Peladang Kawasan, peserta, program ladang kontrak, petani  
Abstract 
This study was conducted to identify the contribution of the Local Farmers Association (PPK) and the level of 
participation of PPK participants in the contract farming program in Selangor Darul Ehsan. The framework of the 
study is based on two main theories namely the combination of Pretty typology and the Arnstein model used to examine 
the level of engagement of contract farming program participants and its contributions in contract farming. 
Convenience sampling is selected in the implementation of this study involving 108 out of 145 total program 
participants contract farm under Local Farmers Association. However, out of 108 questionnaires distributed only 98 
responses were received. The findings show that PPK under the contract farming program was able to improve the 
quality of life of participants in terms of income and distribution, education, health and family with the contribution 
of Local Farmers Association identified within the range of 82.7 to 91.8 percent. Meanwhile, the level of PPK 
participant’s participation under the contract farming program can be said at the grassroots level of engagement and is 
quite encouraging. High-level engagements are functional participation, interactive participation and self-mobilisation. 
These are in line with the Citizen Power in Arnstein model where participants have full authority over engagement. 
Furthermore, by understanding the contribution of PPK and the level of participation of PPK participants in the study 
area, the Ministry of Agriculture and Agro-based Industry, as well as the departments/agencies under it may make 
improvements in ensuring the implementation of this Contract Farming Program really achieves targets and target 
groups. 
Keywords quality of life, local farmers association, participants, contract farming programme, farmer  
8 
 Kualiti Hidup Peserta Program Ladang Kontrak 
 di Bawah Pertubuhan Peladang Kawasan 
 
PENGENALAN  
Kajian ini digubal berdasarkan permasalahan kajian yang ditemui iaitu terdapat pandangan negatif dan 
positif mengenai program ladang kontrak, kurang kajian kualiti hidup program ladang kontrak (hanya kajian 
kualiti perkhidmatan dan pendapatan), serta untuk membuktikan penyertaan dalam Pertubuhan Peladang 
Kawasan (PPK) dalam program ladang kontrak dapat meningkatkan kualiti hidup peserta dari aspek 
pendapatan dan pengagihan, pendidikan, kesihatan serta keluarga.  
Setelah sepuluh tahun pelaksanaan program ladang kontrak terdapat pelbagai pandangan positif dan 
negatif mengenai program ladang kontrak yang dilaksanakan oleh kerajaan. Program ladang kontrak 
bukanlah merupakan satu pilihan utama masyarakat setempat di Malaysia. Hal ini kerana program ladang 
kontrak dianggap kurang berjaya dalam meningkatkan pendapatan peserta (Amriah et al., 2010; Amriah & 
Ratnawati, 2009). Namun begitu, menurut Unit Penyelarasan Pelaksanaan Jabatan Perdana Menteri, 
program ladang kontrak telah berjaya meningkatkan pendapatan peserta ladang kontrak serta kejayaan 
pencapaian sasaran RMK-9 dan RMK-10 (Yusrizal, 2013; Bahagian Pemasaran dan Eksport, MOA, 2006). 
Selain itu, didapati kurangnya kajian terhadap kualiti hidup yang dilaksanakan ke atas program ini. 
Ini disebabkan kajian yang ada hanya memberi fokus kepada pendapatan dan kualiti perkhidmatan sahaja 
(Arumugam et al., 2010; Kaur et al., 2015; Morrison et al., 2006; Yusrizal, 2013). Tambahan pula, tiada 
kajian ke atas penyertaan dalam PPK dalam program ladang kontrak dapat meningkatkan pendapatan dan 
kualiti hidup peserta di Malaysia. Kajian Coulter et al. (1999); Sokchea dan Culas (2015); Key dan Runsten 
(1999);Sarmila et al. 2015; Sarmila et al. 2014 merumuskan bahawa pendapatan petani dan manfaat petani 
dapat ditingkatkan dengan kehadiran pertubuhan peladang dalam ladang kontrak. Di samping itu, terdapat 
kajian yang mencadangkan agar ladang kontrak dan pertubuhan peladang boleh digabungkan dan saling 
melengkapi (Baumann, 2000; Coulter et al., 1999; Key & Runsten, 1999).  
Kajian awal menunjukkan terdapat peningkatan pendapatan peserta ladang kontrak. Pendapatan 
peserta adalah konsisten kerana jaminan pemasaran hasil, kurang kos perniagaan pertanian, lebih kuasa 
tawar menawar, pulangan yang lebih tinggi dan sebagainya. Namun terdapat juga penyertaan dalam ladang 
kontrak ini yang tidak dapat meningkatkan pendapatan peserta ladang kontrak kerana tidak dapat 
meningkatkan kualiti produk, penyertaan pekebun kecil terhad dan kuasa tawar menawar yang rendah. Oleh 
itu, kajian terhadap peserta program ladang kontrak di bawah PPK di Malaysia amat diperlukan. 
Secara umumnya kepentingan kajian ini adalah untuk memberikan satu interpretasi terhadap 
pembacaan tentang definisi dan falsafah yang terkandung dalam PPK. PPK pada dasarnya bertujuan untuk 
meningkatkan kualiti hidup masyarakat. Sungguhpun demikian, ukuran dan juga pelaporan khusus terhadap 
kualiti hidup yang wujud sukar dicapai dalam dunia akademik hari ini. Selain itu, kajian ini turut bertujuan 
untuk mengenal pasti sama ada PPK dapat membantu peserta program ladang kontrak dalam mencapai 
kualiti hidup yang disasarkan kerajaan. Lanjutan daripada itu, dengan memahami tahap penyertaan peserta 
PPK di kawasan kajian, Kementerian Pertanian dan Industri Asas Tani serta jabatan/agensi di bawahnya 
dapat melakukan penambahbaikan dalam memastikan pelaksanaan program ladang kontrak ini benar-benar 
mencapai sasaran dan golongan sasaran. Matlamat umum kajian ini bertujuan untuk mengenal pasti 
sumbangan PPK di bawah program ladang kontrak dan mengkaji tahap penyertaan peserta PPK dalam 
program ladang kontrak.  
KAJIAN LITERATUR  
Kualiti Hidup 
Persoalan tentang kualiti hidup banyak dibahaskan dan dikaji dalam kajian-kajian terdahulu dan ia berkaitan 
dengan pelbagai aspek seperti fenomena politik, sikap, tindakan, kestabilan, optimis dalam jangkaan 
terhadap kehidupan masa depan, kepuasan terhadap kerajaan, kuasa dan penglibatan politik 
(Hayward,1979). Laporan Kualiti Hidup Malaysia (1999) mendefinisikan kualiti hidup sebagai perubahan 
yang berlaku dalam masyarakat dan sistem sosial daripada keadaan yang dianggap kurang memuaskan, 
kepada keadaan yang lebih baik dan memuaskan. Ia merangkumi gaya hidup sihat, kemajuan diri, akses 
dan kebebasan memperoleh ilmu pengetahuan serta tahap kehidupan yang melebihi keperluan asas individu 
dan memenuhi keperluan psikologi untuk mencapai tahap kesejahteraan hidup sosial dengan aspirasi negara 
(Mohd Shaladdin & Nik Wan, 2006). 
Antara definisi kualiti hidup yang digunakan di Malaysia ditakrifkan merangkumi kemajuan diri, 
gaya hidup yang sihat, pencapaian dan kebebasan untuk memperoleh pengetahuan dan menikmati taraf 
9 
 Geografi Vol. (5), No. (2) Special Issue, (2017), 8-22 
     © Penerbit Universiti Pendidikan Sultan Idris 2017 
      ISSN 2289-4470 /eISSN 2462-2400 
Focus editor special issue - Dr Rosniza Aznie Che Rose 
 
hidup yang melebihi keperluan asas dan psikologi individu, mencapai tahap kesejahteraan sosial yang 
seiring dengan hasrat negara. Apabila sesebuah masyarakat beralih kepada suasana kehidupan yang pada 
amnya lebih baik, maka kualiti hidupnya dianggap telah meningkat (Jabatan Perdana Menteri, 2004; Izham 
et al., 2012).  
Kajian mengenai kualiti hidup program ladang kontrak dan program-program pertanian di bawah 
Kementerian Pertanian dan Industri Asas Tani juga terlalu terhad sebagai rujukan. Kebanyakan memberi 
fokus kepada pendapatan peserta ladang kontrak, kualiti perkhidmatan program ladang kontrak (Yusrizal, 
2013) dan kesejahteraan hidup petani MADA (Yusof et al., 2013). Manakala menurut Mohd Shaladdin dan 
Nik Wan (2006), negara Malaysia yang dikatakan negara mempunyai ekonomi yang berjaya oleh Bank 
Dunia didapati telah meminggirkan kumpulan masyarakat petani dalam proses pembangunan. Petani 
terletak pada kedudukan kualiti hidup yang rendah berbanding masyarakat lain. Keadaan ini berlaku 
disebabkan pengukuran kualiti hidup hanya berkisar kepada keadaan ekonomi dan pendapatan. Namun 
begitu, keadaan yang sebenar adalah lebih daripada itu. Ini turut disokong oleh Belt (2011) yang 
menyatakan bahawa pendapatan atau GDP bukan satu perkara yang dilihat dalam mengukur kesejahteraan 
hidup masyarakat. Ini disebabkan perkara lain turut diambil kira dalam mengukur kualiti hidup iaitu seperti 
taraf hidup, kesihatan, pendidikan, aktiviti peribadi, tadbir urus, hubungan sosial, keadaan dan keselamatan 
persekitaran. Aspek yang lebih luas ini turut dinyatakan dalam kajian Norizan (2003) yang menyatakan 
bahawa kesejahteraan hidup merangkumi pendapatan dan pengagihan, persekitaran kerja, kesihatan, 
komunikasi, pengangkutan, alam sekitar, kehidupan, pendidikan dan perumahan. Oleh itu, adalah wajar 
kajian kualiti hidup peserta ladang kontrak dilaksanakan.  
Di samping itu, menurut Belt (2011) dan Nor Malina et al. (2017) kesejahteraan hidup masyarakat 
bukan diukur dengan melihat kepada pendapatan atau GDP sahaja malahan ia turut merangkumi perkara-
perkara seperti taraf hidup, kesihatan, pendidikan, aktiviti peribadi, tadbir urus, hubungan sosial, keadaan 
dan keselamatan. Walau bagaimanapun, selain mengukur perkara-perkara ini secara objektif, bagi mendapat 
keputusan kesejahteraan hidup yang betul-betul mewakili masyarakat maka perlu melihat perkara 
kesejahteraan secara subjektif. Contohnya masyarakat yang ada pekerjaan adalah lebih gembira daripada 
mereka yang tiada kerja, masyarakat yang hidup dalam masyarakat yang mempunyai struktur politik dan 
sosial yang lebih terbuka adalah lebih cenderung untuk berpuas hati dengan kehidupan mereka. Menurut 
Norizan (2003) pula, kesejahteraan hidup boleh dibahagi kepada dua kategori iaitu objektif dan subjektif. 
Kesejahteraan hidup objektif adalah seperti pendapatan, perumahan, kesihatan dan pendidikan yang dapat 
dikecapi individu dan dilihat secara luaran. Kesejahteraan hidup subjektif pula adalah seperti anak-anak 
yang berjaya dan keluarga yang bahagia yang dapat dirasai dan dinikmati.  
Konsep kesejahteraan hidup ini secara rasmi telah digunakan oleh pihak pentadbiran bermula pada 
tahun 2013 dengan menggantikan konsep asal iaitu kualiti hidup. Indeks Kualiti Hidup Malaysia (IKHM) 
1999 menjadi petunjuk utama dalam mengira tahap sosioekonomi penduduk di Malaysia. Dalam mengejar 
arus teknologi semasa dan perubahan sosioekonomi, maka IKHM telah digubah dan diformulasikan semula 
menjadi satu konsep kesejahteraan hidup yang lebih teliti dan mengambil kira banyak aspek dalam kajian 
kesejahteraan hidup. Indeks Kesejahteraan Rakyat Malaysia 2013 merupakan penambahbaikan kepada 
Indeks Kualiti Hidup Malaysia (IKHM) yang telah diterbitkan pada tahun 1999 bertujuan mengukur secara 
kuantitatif pencapaian negara dalam meningkatkan kualiti hidup rakyat (Unit Perancang Ekonomi Jabatan 
Perdana Menteri, 2013). Jabatan Perdana Menteri dalam kajian Indeks Kesejahteraan Rakyat Malaysia 
(IKRM) pada tahun 2013 turut menumpukan kepada komponen kesediaan diri dalam kualiti hidup iaitu 
pendidikan (item 3), kesihatan (item 7), pendapatan dan pengagihan (item 9), dan keluarga (item 5) (Unit 
Perancang Ekonomi Jabatan Perdana Menteri, 2013).  
Menurut Azahan et al. (2006), kualiti hidup boleh dibahagikan kepada tiga iaitu akses ke bandar, 
kesediaan diri, dan persekitaran bandar. Selain itu, aspek akses yang baik turut menggambarkan 
kemampuan penduduk menggunakan kemudahan di bandar. Persekitaran bandar merupakan struktur yang 
sedia ada di kawasan bandar dan menjadi asas kepada komponen kesediaan diri dan akses bandar yang 
didasari oleh agen atau individu kepada masyarakat bandar. Kualiti kesediaan diri yang baik berbanding 
akses dan persekitaran bandar dan ini merupakan satu kekuatan bagi bandar pertengahan meneruskan 
agenda pembangunannya. Konsep kualiti hidup menjadi luas dengan pembahagian ketiga-tiga komponen 
ini. Bagi mewakili kehidupan agen atau individu di bandar yang sebenar pengukuran dibuat dengan sangat 
teliti. Ini turut dipakai guna semasa mendefinisikan makna kualiti kehidupan yang sangat luas dan banyak 
dibahaskan dan dikaji (Azahan et al., 2006; Azahan et al., 2008; Yusrizal, 2013). Justeru itu, bagi tujuan 
10 
 Kualiti Hidup Peserta Program Ladang Kontrak 
 di Bawah Pertubuhan Peladang Kawasan 
 
pelaksanaan kajian ini, komponen kesediaan diri bagi kualiti hidup (yang merangkumi aspek pendapatan 
dan pengagihan, pendidikan, kesihatan dan keluarga) sebagaimana yang diketengahkan oleh Azahan et al. 
(2006) dan Azahan et al. (2008) dan Indeks Kesejahteraan Rakyat Malaysia 2013 (IKRM) akan digunakan 
sebagai alat untuk mengukur perubahan terhadap kualiti hidup yang dialami oleh peserta yang telah dipilih 
sebagai subjek untuk kajian.  
Pertubuhan Peladang Kawasan 
Lembaga Pertubuhan Peladang (LPP) telah ditubuhkan pada 14 Februari 1973 melalui penggubalan Akta 
LPP 1973 (Akta 110) iaitu Akta Lembaga Pertubuhan Peladang. Penubuhan LPP adalah bertujuan untuk 
memikul tanggungjawab membantu mempertingkat ekonomi dan sosial masyarakat tani di bawah satu 
badan yang berperanan khusus. Pertubuhan Peladang (PP) di peringkat kawasan dipanggil Pertubuhan 
Peladang Kawasan (PPK), di peringkat negeri dipanggil Pertubuhan Peladang Negeri (PPN) dan di 
peringkat nasional dipanggil Pertubuhan Peladang Kebangsaan (NAFAS) (Lembaga Pertubuhan Peladang, 
2017). Tujuan penglibatan LPP dalam program ladang kontrak adalah untuk menjamin pasaran dan 
meningkatkan pendapatan, pengeluaran sayuran-sayuran serta buah-buahan, menggalakkan pemindahan 
teknologi pada rantaian bekalan dan memastikan pengeluaran hasil pertanian berkualiti serta menepati 
kehendak pasaran.  
Aspek pertubuhan peladang pula turut dikupas oleh kajian-kajian Coulter et al. (1999); Key dan 
Runsten (1999); Sokchea dan Culas (2015) yang mencadangkan bahawa pendapatan petani dan manfaat 
terhadap petani dapat ditingkatkan dengan kehadiran pertubuhan-pertubuhan peladang di dalam ladang 
kontrak. Perbincangan Coulter et al. (1999) memberi cadangan bahawa pertubuhan peladang dan ladang 
kontrak boleh diintegrasi bersama dengan baik. Sementara itu, Key dan Runsten (1999) pula mencadangkan 
bahawa pertubuhan-pertubuhan peladang dapat membantu meningkatkan kuasa tawar-menawar petani dan 
mengurangkan kos pengoperasian pertanian. Seiring dengan itu, dalam kajian Baumann (2000); Coulter et 
al. (1999); Sokchea dan Culas (2015) turut menunjukkan bahawa ladang kontrak dan pertubuhan-
pertubuhan peladang boleh digabungkan dan saling melengkapi. Contohnya melalui pertubuhan-pertubuhan 
peladang ladang kontrak mendapat kepastian dalam pasaran untuk hasil keluaran dan memiliki kuasa tawar-
menawar yang lebih tinggi dalam pasaran.  
PPK turut dinyatakan dapat membangunkan usahawan tani dan modal sosial dalam komuniti iaitu PPK 
yang disertai seperti di dalam kajian-kajian (Sarmila et al., 2014; 2015). Tambahan pula, peningkatan 
pendapatan peserta petani bawah persatuan/pertubuhan petani atau peladang yang mengikut program ladang 
kontrak di Cambodia turut menyumbang kepada pembentukan penggubalan kajian ini iaitu kajian mengenai 
PPK perlu dilaksanakan di Malaysia (Sokchea & Culas, 2015). 
Menurut Key dan Runsten (1999), pertubuhan peladang dapat meningkatkan kuasa tawar menawar 
peladang dan mengurangkan kos dalam perniagaan pertanian. Organisasi pengeluar seperti koperasi 
pemasaran bertindak untuk mengurangkan kos urus niaga ladang kontrak bagi firma dan petani berskala 
kecil. Menurut beliau juga, agensi-agensi kerajaan dan pertubuhan bukan kerajaan (NGOs) telah 
menggalakkan persatuan pengeluar atau pertubuhan peladang agar persatuan ini dapat digunakan dalam 
menguatkuasa kontrak dan memperoleh syarat-syarat kontrak yang lebih menguntungkan petani. 
Urusniaga kos perolehan input dan menjual output atau hasil keluaran ladang dapat dikurangkan 
dengan meningkatkan maklumat dan infrastruktur pengangkutan. Seterusnya untuk penembusan pasaran 
yang lebih mendalam oleh pengedar input atau hasil, serta galakan institusi inovasi pengeluaran dan 
pemasaran koperasi dilahirkan. Sesungguhnya, kajian ini menunjukkan kemunculan Pergerakan Pemasaran 
Jagung (Maize Marketing Movement) dapat mengurangkan kos urus niaga dan menggalakkan urus niaga 
pasaran. Pemasaran berkumpulan ini adalah hampir sama dengan pertubuhan peladang iaitu gabungan 
petani-petani yang hanya mempunyai satu tujuan iaitu memberi faedah kepada peserta ladang kontrak dalam 
kes ini ia dapat mengurangkan kos transaksi atau kos urus niaga dalam pasaran (Alene et al., 2008). 
 Kajian lain yang dijalankan terhadap pembangunan usahawan tani melalui inisiatif tanggungjawab 
sosial korporat (CSR) telah menunjukkan bahawa projek CSR ke atas perladangan cili kontrak di Pasir 
Puteh, Kelantan dapat dilaksanakan dengan baik dengan kerjasama PPK dan syarikat korporat. Hubungan 
baik itu berlaku kerana petani bukan sahaja berpeluang untuk memiliki, mengelola dan mengurus ladang 
serta menanggung risiko pengeluaran tani mereka malahan pihak swasta dan kerajaan melalui PPK 
membantu menyediakan persekitaran yang kondusif bagi pembangunan usahawan tani ini. Projek ini 
merupakan salah satu jenis ladang kontrak yang dilakukan kerajaan (Sarmila et al., 2014). Kajian kes projek 
CSR peladang cili kontrak oleh Sarmila et al. (2015) turut menunjukkan projek ini mampu untuk 
membangunkan modal sosial dalam komuniti yang terlibat dengannya. Projek ini berpotensi untuk 
11 
 Geografi Vol. (5), No. (2) Special Issue, (2017), 8-22 
     © Penerbit Universiti Pendidikan Sultan Idris 2017 
      ISSN 2289-4470 /eISSN 2462-2400 
Focus editor special issue - Dr Rosniza Aznie Che Rose 
 
membangunkan salah satu elemen penting dalam mencapai pembangunan komuniti iaitu modal sosial. 
Melalui modal sosial ini komuniti mempunyai keupayaan untuk bertindak bagi meneruskan usaha 
melaksanakan proses pembangunan ekonomi bagi penambah baik keadaan komuniti sedia ada. Pertubuhan 
komuniti yang dinyatakan dalam kes ini ialah PPK. Terdapat lima tema asas yang muncul dalam hasil kajian 
ini, iaitu adalah seperti : i) sering berbincang dan melakukan pertemuan; ii) hubungan yang rapat antara 
peladang; iii) kesediaan saling membimbing sesama peladang; iv) berkongsi masalah, kemahiran dan 
maklumat; dan v) usaha menanam berkumpulan. PPK boleh disimpulkan selain berperanan dalam 
memberikan pinjaman kredit serta berperanan untuk menyediakan suasana atau keadaan yang proaktif 
dalam memupuk kelahiran komuniti petani yang berjaya dengan meningkatkan kualiti hidup mereka. 
Ladang Kontrak 
Menurut Prowse (2012) dengan menggabungkan definisi Hamilton (2008), ladang kontrak boleh 
didefinisikan sebagai persetujuan kontrak bagi tempoh yang ditetapkan antara seorang petani dan sebuah 
firma secara lisan atau secara bertulis sebelum suatu pengeluaran bermula. Firma akan menyediakan 
sumber-sumber untuk petani dan/atau menentukan satu atau lebih syarat-syarat pengeluaran, satu atau lebih 
syarat-syarat pemasaran produk pertanian di atas tanah yang dimiliki atau dikawal oleh petani, di mana ia 
tidak boleh dipindah milik dan memberi hak eksklusif dan undang-undang ke atas tanaman bagi pihak firma.  
Manakala di Malaysia, ladang kontrak boleh didefinisikan sebagai aktiviti memadankan pengeluaran 
hasil pertanian tanaman dengan permintaan di pasaran. Pelaksanaan program ini mengambil kira semua 
aktiviti yang berkaitan di sepanjang rantaian bekalan pengeluaran pertanian di mana khidmat-khidmat 
sokongan untuk menjayakan projek ini seperti kemudahan lepas tuai yang merangkumi pusat pengumpulan 
serta pusat penggredan yang dibina dan disediakan oleh Kerajaan (Kementerian Pertanian dan Industri Asas 
Tani, 2016). Pertanian dilihat bukan sahaja menjadi amalan pertanian tradisi, sebaliknya merupakan 
perubahan budaya baru dalam keperluan hasil tanaman dan pengeluaran masa kini. Hal ini kerana, manusia 
mempunyai banyak kelebihan berbanding spesies organisma lain seperti kelebihan fizikal yang seimbang 
dan keupayaan mental yang tinggi. Manusia bersifat menguasai alam sekitar kerana secara ekologinya 
dominan (Katiman 2013). 
Penyertaan peserta PPK melalui ladang kontrak boleh membawa kepada perubahan kualiti hidup 
mereka dari aspek pendapatan & pengagihan, pendidikan, kesihatan dan keluarga. Kebanyakan kajian 
menunjukkan bahawa ladang kontrak berjaya meningkatkan aspek pendapatan dan pengagihan peserta 
dalam lingkungan 10 hingga 50 peratus dengan signifikannya (Bellemare, 2010; Minot, 1986; Miyata et al., 
2009; Warning & Key, 2002; Rao & Qaim, 2010). Ini turut disokong oleh kajian terkini Minot dan Sawyer 
(2014) di mana kebanyakan kes menunjukkan mengalami peningkatan pendapatan pada lingkungan 25 
hingga 75 peratus. Perkara yang sama turut berlaku di Malaysia iaitu pelaksanaan program ladang kontrak 
di Malaysia didapati mampu meningkatkan pendapatan para petani. Ini dapat dibuktikan oleh kajian-kajian 
yang dijalankan di Malaysia (Arumugam et al., 2010; Kaur et al., 2015; Morrison et al., 2006). Selain itu, 
menurut kajian-kajian yang dilaksanakan di Malaysia PPK dapat meningkatkan pendapatan peserta program 
ladang kontrak dan kualiti hidup peserta di Malaysia (Coulter et al., 1999; Sokchea & Culas, 2015; Key & 
Runsten, 1999).  
Di samping itu, aspek pendidikan peserta dikupas oleh kajian Sokchea dan Culas (2015) yang 
menyatakan bahawa pertubuhan peladang memberi pendidikan dari segi kepakaran dan kemahiran kepada 
peserta yang menyertai ladang kontrak. Contohnya, Reasmey Stung Sen Agricultural Development 
Cooperative in Cambodia (RSSADC) melaksanakan komiti pemeriksaan bagi mengawal kualiti keluaran 
dan memenuhi standard pasaran. Ini secara tidak langsung memberi pendidikan teknikal kepada peserta-
peserta ladang kontrak mengenai standard produk keluaran yang memenuhi syarat pasaran dan cara 
memelihara kualiti keluaran. Pendidikan yang diberikan kepada peserta adalah dalam bentuk latihan, 
bantuan teknikal, input khusus, kawalan standard kualiti keluaran, teknologi dan amalan pengeluaran baik 
(Miyata et al., 2009; Morgan, 2006; Ramaswami et al., 2005; Sokchea & Culas, 2015). Selain itu, ladang 
kontrak turut memperkasakan aspek pendidikan individu melalui pembangunan pemahaman dalam 
rundingan kontrak, pasaran dan perakaunan serta membangunkan modal insan komuniti yang dilaksanakan 
oleh syarikat korporat dan agensi pembangunan ladang kontrak (Baumann, 2000; Sarmila et al., 2015). 
Akhirnya kemahiran yang diturunkan kepada petani ladang kontrak termasuk cara penyimpanan rekod, 
penggunaan sumber ladang dengan cekap, kaedah yang lebih baik untuk menggantikan bahan kimia dan 
baja, pengetahuan dalam kepentingan kualiti pengeluaran dan syarat-syarat dan keperluan untuk eksport 
12 
 Kualiti Hidup Peserta Program Ladang Kontrak 
 di Bawah Pertubuhan Peladang Kawasan 
 
merupakan kebaikan atau sumbangan ladang kontrak kepada peserta. Pengalaman yang diperoleh semasa 
melakukan aktiviti pertanian turut merupakan kemahiran yang diturunkan kepada petani. Justeru itu, kesan 
limpahan daripada ladang kontrak turut memberi peluang kepada petani untuk membuat pelaburan 
infrastruktur dan modal insan. Ini secara tidak langsung dapat meningkatkan produktiviti (Rani, 2000).  
Justeru, hasil-hasil kajian membuktikan aspek kesihatan dalam kualiti hidup peserta ladang kontrak 
dapat ditingkatkan dengan meningkatkan kemampuan petani berbelanja lebih dalam penjagaan kesihatan 
dan pemakanan, penggunaan teknologi dan amalan pengeluaran baik dalam pertanian serta penggunaan 
standard operasi dan kaedah penanaman organik (Glover & Kusterer, 1990; Miyata et al., 2009; Ramaswami 
et al., 2005; Sokchea & Culas, 2015). Pemakanan dalam kalangan keluarga petani adalah lebih cenderung 
untuk bertambah baik daripada merosot. Ini disebabkan pendapatan isi rumah telah meningkat. Tahap 
pemakanan yang meningkat menunjukkan berlaku peningkatan dalam kesihatan petani dan ahli-ahli 
keluarga. Namun begitu, terdapat pandangan negatif mengenai ladang kontrak terhadap kesihatan petani 
dengan penggunaan bahan kimia dalam penanaman dan peningkatan hutang peserta serta menjejaskan 
kesihatan peserta (Barrett et al., 2011; Baumann, 2000).  
Aspek akhir yang dikaji dalam hubungan antara PPK ladang kontrak dan kualiti hidup adalah aspek 
keluarga. Peningkatan pendapatan membolehkan isi rumah membuat perbelanjaan untuk isi rumah. Justeru 
itu mengizinkan peserta membuat pembayaran hutang isi rumah dari bentuk perumahan, kereta, peribadi, 
kewangan dan sebagainya. Ini menunjukkan bahawa aspek keluarga dapat ditingkatkan (Minot, 1986). 
Kemasukan wanita sebagai tenaga kerja dalam pengeluaran jagung dapat meningkatkan pendapatan 
keluarga membolehkan mereka memenuhi keperluan asas, tempat tinggal, pakaian pendidikan untuk kanak-
kanak dan ubat-ubatan. Ini secara tidak langsung meningkatkan aspek keluarga kualiti hidup peserta 
(Morgan, 2006). Kebanyakan kajian turut menunjukkan bahawa isi rumah peserta ladang kontrak 
menikmati tahap kebajikan yang lebih tinggi, menurunkan ‘tempoh musim lapar’ yang dialami isi rumah, 
mengurangkan ketidakstabilan jumlah pendapatan isi rumah, menyenangkan kehidupan dan daya saing 
peserta dalam meneruskan kontrak, mengurangkan kemiskinan peserta serta meningkatkan pulangan dan 
membaiki kehidupan peserta (Barrett et al., 2011; Bellemare, 2010; Simmons et al., 2005).  
TEORI KAJIAN 
Kerangka kajian (Rajah 1) berdasarkan kepada dua teori utama iaitu gabungan Tipologi Pretty dan Model 
Arnstein (Pretty, 1995; Arnstein, 1969) yang digunakan untuk mengkaji tahap penglibatan peserta program 
ladang kontrak dan sumbangan-sumbangan PPK dalam ladang kontrak yang dikemukakan dalam kajian 
(Sokchea & Culas, 2015). Pernyataan-pernyataan di dalam Mowforth dan Munt (1998) turut digunakan 
untuk menerangkan lebih jelas tentang penglibatan-penglibatan tersebut. Penglibatan yang dikaji terdiri 
daripada penglibatan manipulatif, penglibatan pasif, penglibatan melalui perundingan, penglibatan 
bermotivasikan pulangan material yang diperlukan oleh penduduk, penglibatan berfungsi, penglibatan 
interaktif dan penglibatan pergerakan sendiri.  
Sumbangan-sumbangan yang dikaji pula terdiri daripada meningkatkan pendapatan, menjamin 
pemasaran hasil, mengurangkan kos perniagaan pertanian, menyediakan lebih banyak kuasa tawar 
menawar, pulangan yang lebih tinggi, meningkatkan kualiti produk, menyasarkan pasaran khusus, 
penyertaan pekebun kecil dalam ladang kontrak dan pengumpulan aset produktif semua petani (besar, 
sederhana dan kecil). 
 
13 
 Geografi Vol. (5), No. (2) Special Issue, (2017), 8-22 
     © Penerbit Universiti Pendidikan Sultan Idris 2017 
      ISSN 2289-4470 /eISSN 2462-2400 
Focus editor special issue - Dr Rosniza Aznie Che Rose 
 
 
 
Rajah 1 Kerangka kajian 
Sumber: Diubahsuai daripada Arnstein (1969); Haslina & Regina (2009); Pretty (1995); Mowforth & Munt (1998) dan Sokchea 
& Culas (2015)  
Manakala Jadual 1 menunjukkan tahap penglibatan yang digunakan dalam melaksanakan kajian ini 
dengan menggabungkan Tipologi Pretty dan Model Arnstein. Ciri-ciri penglibatan manipulatif dalam 
Tipologi Pretty adalah sama dengan penglibatan secara manipulasi Model Arnstein. Penglibatan pasif 
Tipologi Pretty pula adalah sama dengan ciri di penglibatan secara terapi Model Arnstein. Penglibatan 
melalui perundingan, penglibatan bermotivasikan pulangan material yang diperlukan dan penglibatan 
berfungsi adalah sama dengan ciri-ciri dalam penglibatan melalui pemberitahuan/makluman dalam Model 
Arnstein. Akhirnya, penglibatan interaktif dan penglibatan pergerakan sendiri Tipologi Pretty adalah sama 
dengan penglibatan secara kerjasama/usaha sama, penglibatan secara pembahagian kuasa dan penglibatan 
penuh (kawalan sepenuhnya oleh komuniti). Selain itu, gabungan Tipolgi Pretty dan Model Arnstein turut 
memaparkan tangga penyertaan komuniti dalam Model Arnstein yang terdiri daripada bukan penyertaan 
(nonparticipation), amalan tanda (tokenism) dan kuasa komuniti (citizen power). 
Jadual 1 Tipologi dalam penglibatan komuniti 
Pretty (1995) Arnstein (1969) Tangga penyertaan komuniti 
1. Penglibatan 1. Penglibatan secara manipulasi Bukan penyertaan/ 
manipulatif nonparticipation 
2. Penglibatan pasif 2. Penglibatan secara terapi 
3. Penglibatan melalui 3. Penglibatan melalui pemberitahuan/makluman Amalan tanda/ 
perundingan Tokenism 
 
4. Penglibatan 4. Penglibatan melalui perundingan  
bermotivasikan     pulangan material yang diperlukan  
    oleh penduduk 
5. Penglibatan 5. Penglibatan secara pujukan 
berfungsi 
6. Penglibatan 6. Penglibatan secara kerjasama/ usaha sama Kuasa Komuniti/ Citizen power 
interaktif 
 
7. Penglibatan 7. Penglibatan secara pembahagian kuasa 
pergerakan sendiri 
 8. Penglibatan penuh (kawalan sepenuhnya oleh  
    komuniti) 
Sumber: Diubahsuai daripada Arnstein (1969), Haslina & Regina (2009) dan Pretty (1995) 
14 
 Kualiti Hidup Peserta Program Ladang Kontrak 
 di Bawah Pertubuhan Peladang Kawasan 
 
 
METOD KAJIAN  
 
Data primer dan data sekunder merupakan data yang dikumpul dalam kajian ini. Data-data ini dikumpulkan 
untuk mengetahui maklumat dan keadaan peserta PPK di bawah program ladang kontrak di Selangor Darul 
Ehsan. Data primer kajian ini diperoleh dengan menggunakan borang soal selidik dan pemerhatian ketika 
mengedarkan borang soal selidik di Selangor Darul Ehsan. Kawasan kajian merangkumi daerah Hulu 
Langat, Hulu Selangor, Klang, Kuala Langat, Kuala Selangor, Petaling, Sabak Bernam dan Sepang. 
Manakala data sekunder seperti minit mesyuarat, laporan dan kertas kerja diperoleh daripada Kementerian 
Pertanian dan Industri Asas Tani, Lembaga Pemasaran Pertanian Persekutuan (FAMA) dan Lembaga 
Pertubuhan Peladang (LPP). Data-data sekunder ini sangat berguna dalam membantu pengkaji dalam 
memahami pelbagai konsep kajian sebelum ini dan memberikan idea umum yang mempunyai hubung kait 
dengan kajian.  
Selangor Darul Ehsan dipilih sebagai skop bagi kawasan kajian ini disebabkan Selangor merupakan 
salah satu buah negeri yang mengeluarkan enam produk utama ladang kontrak iaitu nanas, pisang, tembikai, 
labu manis, cili merah dan timun yang mewakili 60 peratus jumlah keluasan tanaman yang berdaftar bawah 
program ladang kontrak (Lembaga Pemasaran Pertanian Persekutuan, 2012). Sementara itu, menurut hasil 
keluaran ladang kontrak 2015, hasil keluaran Selangor merupakan yang tertinggi dalam kalangan negeri di 
seluruh negara (MOA, 2016). Persampelan mudah dipilih dalam pelaksanaan kajian ini kerana teknik ini 
adalah teknik yang berdasarkan penyelidik mengambil individu secara mudah dan boleh memberi 
kerjasama yang dapat membantu kajian ini dilakukan (Othman, 2013). Populasi peserta program ladang 
kontrak di bawah PPK adalah seramai 145 orang. Sementara itu, berpandukan pemilihan saiz sampel Krejcie 
dan Morgan (1970), saiz sampel adalah 108 orang peserta PPK di bawah program ladang kontrak di 
kawasan kajian. Walau bagaimanapun, daripada 108 borang soal selidik yang diedarkan hanya 98 jawapan 
responden yang diterima kerana responden tiada di rumah, berpindah, enggan memberikan kerjasama dan 
sebagainya. Bagi tujuan penganalisisan data, perisian Statistical Package for Social Sciences (SPSS) 
digunakan. Data yang diperoleh ini dianalisis dengan menggunakan analisis deskriptif. 
HASIL KAJIAN DAN PERBINCANGAN  
Sumbangan Pertubuhan Peladang Kawasan di Bawah Program Ladang Kontrak 
Hasil kajian dianalisis dengan 98 orang responden yang diterima. Hasil kajian yang dianalisis pada bahagian 
ini ialah sumbangan PPK di bawah program ladang kontrak. Untuk memudahkan proses menganalisis skala 
likert 3 peringkat telah dikelaskan kepada 3 tahap seperti dalam Jadual 2 dan Jadual 3. Nilai 2.34 hingga 
3.00 adalah terletak di tahap yang paling tinggi, 1.67 hingga 2.33 pada tahap sederhana dan 1.00 hingga 
1.66 di tahap yang paling rendah.  
Jadual 2 Nilai skor min 
Nilai Skor Min Tahap 
2.34 hingga 3.00 Tinggi 
1.67 hingga 2.33 Sederhana 
1.00 hingga 1.66 Rendah 
Sumber: Olahan Pengkaji (2017) 
Jadual 3 Ringkasan Item 
Item Ringkasan 
Tidak Setuju TS 
Tidak Pasti TP 
Setuju S 
Sumber: Olahan Pengkaji (2017) 
 
Rajah 2 menunjukkan sumbangan PPK di bawah program ladang kontrak. Sumbangan tersebut 
adalah seperti meningkatkan pendapatan, menjamin pasaran, mengurangkan kos perniagaan, lebih kuasa 
tawar-menawar, menjamin pulangan, meningkatkan kualiti produk, menyasar pasaran khusus, penyertaan 
pekebun kecil dan pengumpulan aset produktif. Antara sumbangan yang paling dipersetujui responden 
adalah sumbangan meningkatkan pendapatan responden iaitu 91.8 peratus. Ini diikuti sumbangan menjamin 
15 
 Geografi Vol. (5), No. (2) Special Issue, (2017), 8-22 
     © Penerbit Universiti Pendidikan Sultan Idris 2017 
      ISSN 2289-4470 /eISSN 2462-2400 
Focus editor special issue - Dr Rosniza Aznie Che Rose 
 
pasaran (90.8 %), penyertaan pekebun kecil (86.7 %), mengurangkan kos perniagaan (85.7 %), 
meningkatkan kualiti produk (85.7 %), lebih kuasa tawar-menawar (84.7 %), menjamin pulangan (83.7 %), 
menyasar pasaran khusus (82.7 %) dan pengumpulan aset produktif (82.7 %).  
 
94
91.8
92
90.8
90
88
86.7
85.7 85.7
86
84.7
83.7
84
82.7 82.7
82
80
78
S
Sumbangan PPK
Meningkatkan Pendapatan Menjamin Pasaran
Mengurang Kos Perniagaan Lebih Kuasa Tawar-menawar
Menjamin Pulangan Meningkatkan Kualiti Produk
Menyasar Pasaran Khusus Penyertaan Pekebun Kecil
Pengumpulan Aset Produktif
 
 
Rajah 2 Sumbangan PPK di bawah program ladang kontrak 
Sumber: Kajian lapangan (2017) 
 
Hasil dapatan ini turut disokong dengan skor nilai min di mana kesemua sumbangan yang dinyatakan 
adalah pada tahap tinggi iaitu 2.34 hingga 3.00. Skor min turut membuktikan semula bahawa PPK di bawah 
program ladang kontrak dapat meningkatkan pendapatan peserta. 2.92 merupakan skor nilai min bagi 
sumbangan peningkatan pendapatan peserta. Seterusnya, menjamin pasaran merupakan sumbangan yang 
kedua tinggi tahapnya iaitu 2.91. Skor min yang ketiga tinggi adalah penyertaan pekebun kecil 2.87 min. 
Ini secara tidak langsung menunjukkan bahawa PPK di bawah program ladang kontrak telah membuka 
peluang kepada pekebun kecil dalam menyertai program ladang kontrak. Sumbangan seperti mengurangkan 
kos perniagaan dan meningkatkan kualiti produk merupakan sumbangan yang keempat tinggi, masing-
masing memberikan skor min 2.86. Lebih kuasa tawar menawar merupakan sumbangan kelima tertinggi 
iaitu dengan nilai skor min 2.85. Akhirnya sumbangan paling rendah adalah menjamin pulangan, menyasar 
pasaran khusus dan pengumpulan aset produktif, masing-masing memberikan nilai skor min 2.83.  
 PPK di bawah program ladang kontrak telah memberi sumbangan yang besar kepada peserta di 
Selangor Darul Ehsan. Sumbangan-sumbangan yang dikenal pasti adalah ia dapat meningkatkan 
pendapatan peserta (91.8 %). Penyertaan dalam PPK di bawah program ladang kontrak dapat membantu 
untuk meningkatkan pendapatan mereka. Ini disebabkan PPK di bawah program ladang kontrak memberi 
fokus lebih kepada peserta di bawahnya dan sentiasa memastikan keuntungan berpihak kepada peserta. 
Keadaan ini berbeza dengan peserta yang bukan PPK di mana keuntungan mereka tidak diberi perhatian 
dan hanya di atas usaha diri sendiri sahaja. Selain itu, PPK di bawah program ladang kontrak turut dikenal 
pasti bahawa PPK dapat membantu dalam menjamin pemasaran kepada hasil keluaran peserta iaitu 90.8 
peratus. Ini disebabkan untuk meneguhkan keuntungan kepada semua peserta bawah PPK, PPK akan 
sentiasa memastikan pasaran yang terjamin semasa kontrak ditandatangani. Tambahan pula PPK akan 
meneguhkan kerjasama FAMA dan jabatan/agensi kerajaan di bawah Kementerian Pertanian dan Industri 
Asas Tani agar bersedia untuk menjamin dan membantu dalam pemasaran hasil keluaran. Keadaan ini amat 
16 
 
Peratus RespondenKualiti Hidup Peserta Program Ladang Kontrak 
 di Bawah Pertubuhan Peladang Kawasan 
 
berbeza dengan petani persendirian yang terpaksa menghadapi masalah pemasaran hasil keluaran. 
Mengurangkan kos perniagaan pertanian turut merupakan sumbangan PPK yang seterusnya (85.7 peratus). 
Ini disebabkan bantuan input perkhidmatan yang disediakan kepada peserta PPK bawah program ladang 
kontrak adalah seperti perkhidmatan pemasaran dan pemadanan pasaran, khidmat nasihat teknikal, 
kemudahan input pertanian, kemudahan pembangunan dan infrastruktur pemasaran dan kemudahan kredit 
(pinjaman) diberikan kepada peserta. Melalui cara ini, kos perniagaan pertanian dapat diminimumkan dan 
kesannya adalah peningkatan pendapatan peserta.  
 Di samping itu, PPK bawah program ladang kontrak turut meningkatkan kuasa tawar-menawar 
kepada petani iaitu sebanyak 84.7 peratus. Ini disebabkan PPK akan memastikan tawaran yang paling tinggi 
diberikan kepada peserta berbanding dengan petani yang bukan peserta. Ini disebabkan PPK biasanya 
mempunyai ramai peserta, dengan kuasa peserta yang ramai ini ia dapat meningkatkan kuasa tawar 
menawar kepada petani. Keadaan yang sebaliknya berlaku jika petani persendirian yang terpaksa akur 
dengan kontrak yang tidak berapa menguntungkan mereka. Menjamin pulangan yang lebih tinggi 
merupakan sumbangan PPK di bawah program ladang kontrak yang seterusnya (83.7 peratus). PPK akan 
memastikan peserta mendapat pulangan yang tinggi melalui jaminan pemasaran hasil keluaran, kos 
perniagaan pertanian yang lebih rendah dan kuasa tawar menawar yang tinggi. Dengan ini, pulangan peserta 
akan menjadi lebih tinggi berbanding dengan peserta yang tidak menyertai PPK.  
 Sumbangan PPK di bawah program ladang kontrak yang lain adalah seperti membantu dalam 
meningkatkan kualiti produk/hasil keluaran iaitu 85.7 peratus. Khidmat nasihat teknikal, kemudahan input 
pertanian dan kemudahan pembangunan dan infrastruktur pemasaran yang disediakan membantu dalam 
meningkatkan kualiti produk/hasil keluaran. Tambahan pula amalan pertanian baik (MyGAP) yang 
dilaksanakan turut memastikan hasil keluaran pada tahap yang standard dan berkualiti. Dengan adanya 
bantuan daripada jabatan/agensi di bawah Kementerian Pertanian dan Industri Asas Tani, pasaran yang 
khusus dapat disasarkan (82.7 peratus). Pasaran khusus yang disasarkan dapat membantu dalam menjamin 
pemasaran serta meningkatkan pendapatan peserta. Ini turut merupakan sumbangan PPK di bawah program 
ladang kontrak. Selain itu, peserta pekebun kecil turut memperoleh faedah daripada ladang kontrak. Ini 
disebabkan pekebun kecil biasanya tidak menarik perhatian firma untuk membolehkan mereka menyertai 
program ladang kontrak. Namun begitu, melalui penyertaan PPK, pekebun kecil dapat memperoleh faedah 
yang diperoleh melalui program ladang kontrak. Sebanyak 86.7 peratus peserta bersetuju dengan kenyataan 
ini.   
Sumbangan PPK di bawah program ladang kontrak yang terakhir ialah peserta ini dikatakan dapat 
mengumpulkan aset produktif iaitu aset yang digunakan untuk pengeluaran hasil dengan bergabung dengan 
petani (besar, sederhana dan kecil) di bawah PPK program ladang kontrak (82.7 peratus). Pengumpulan aset 
produktif ini memboleh peserta melaksanakan program ini tanpa masalah dan kekangan yang besar dengan 
adanya kerjasama daripada semua peserta yang bergabung.  
Tahap Penyertaan Peserta PPK Dalam Program Ladang Kontrak 
Tahap penyertaan peserta PPK dalam program ladang kontrak boleh dilihat melalui penglibatan-penglibatan 
seperti penglibatan manipulatif, penglibatan pasif, penglibatan melalui perundingan, penglibatan 
bermotivasikan pulangan material yang diperlukan oleh pendudukan, penglibatan berfungsi, penglibatan 
interaktif dan penglibatan pergerakan sendiri iaitu pengurusan melalui kaedah bukan perundangan 
(Muhammad Rizal et al., 2011). Penglibatan manipulatif merupakan penglibatan di mana penyertaan peserta 
dalam program ini hanyalah nama sahaja dan tidak mempunyai kuasa sebenarnya dalam membuat 
keputusan atau menyuarakan pendapat. Mereka adalah boneka kepada pihak tertentu yang berkuasa. Hasil 
kajian menunjukkan bahawa 20 peratus ke atas responden tidak bersetuju dengan penglibatan peserta hanya 
nama sahaja, komuniti tidak berkuasa dan tidak dapat bersuara dan keputusan dan kuasa terletak di pihak 
berkuasa (agensi/jabatan) yang berpengaruh sahaja. Masing-masing 25.5 peratus, 24.5 peratus dan 23.5 
peratus. Ini turut disokong skor nilai min ketiga-tiga perkara yang berada di tahap sederhana 1.67 hingga 
2.33. Ini disebabkan peserta tidak bersetuju dengan perkara di bawah penglibatan manipulatif di mana 
keadaan sebenarnya, peserta turut melakukan penglibatan dalam ladang kontrak, berkuasa dan dapat 
bersuara serta membuat keputusan dan mempunyai kuasa yang sama dengan pihak berkuasa 
(jabatan/agensi). Tambahan pula purata skor nilai min penglibatan manipulatif adalah pada tahap sederhana. 
Dengan ini, ia menunjukkan bahawa tahap penyertaan peserta PPK dalam program ladang kontrak bawah 
Penglibatan Manipulatif adalah pada tahap yang sederhana.  
Penglibatan pasif adalah penglibatan di mana maklum balas peserta dalam suatu projek tidak diminta 
dan keputusan dibuat oleh pihak berkuasa/penggerak. Tambahan pula, pendapat profesional luar dianggap 
17 
 Geografi Vol. (5), No. (2) Special Issue, (2017), 8-22 
     © Penerbit Universiti Pendidikan Sultan Idris 2017 
      ISSN 2289-4470 /eISSN 2462-2400 
Focus editor special issue - Dr Rosniza Aznie Che Rose 
 
lebih penting daripada pandangan peserta. Penglibatan dalam projek setelah keputusan dibuat oleh pihak 
penggerak, maklum balas peserta tidak diminta dan pembangunan masih bukan di bawah kawalan peserta 
merupakan perkara yang dikaji bawah penglibatan pasif. Kebanyakan responden didapati tidak pasti 
mengenai penglibatan pasif ini. Ini ditunjukkan dalam jawapan tidak pasti responden adalah pada 60.2 
peratus (keputusan pihak penggerak), 50 peratus (maklum balas tidak diminta) dan 51 peratus (bukan bawah 
kawalan peserta). Tahap bagi penglibatan pasif ini adalah pada peringkat sederhana iaitu 1.67 hingga 2.33. 
Ini disebabkan kebanyakan peserta tidak pasti perkara-perkara di bawah penglibatan pasif. Purata skor nilai 
min penglibatan peserta adalah pada tahap sederhana yang bermaksud peserta turut terlibat dalam buat 
keputusan projek, maklum balas peserta turut diminta dan peserta turut tidak mempunyai kawalan terhadap 
projek. Oleh itu, boleh dikatakan tahap penglibatan pasif peserta PPK dalam program ladang kontrak adalah 
sederhana. Hasil purata skor nilai min pada tahap yang sederhana bagi kedua-dua perkara ini menunjukkan 
penglibatan peserta PPK program ladang kontrak bukan pada peringkat permulaan disebabkan penyertaan 
peserta bukan nama sahaja dan penglibatan peserta adalah bukan pasif kerana peserta turut terlibat dalam 
membuat keputusan projek. Kedua-dua penglibatan di atas turut jatuh dalam hierarki Model Arnstein (1969) 
iaitu penglibatan secara manipulasi dan penglibatan secara terapi di mana penyertaan adalah pada peringkat 
awal - bukan penyertaan (nonparticipation). Tahap yang sederhana menunjukkan hanya segelintir 
penyertaan peserta bukan pada tahap peringkat awal – bukan penyertaan (nonparticipation). 
 Penglibatan melalui perundingan merupakan tahap penyertaan yang dikaji seterusnya. Penglibatan 
melalui perundingan bermaksud agensi meminta pandangan dan input peserta mengenai projek. Selain itu, 
perkongsian maklumat sehala sahaja di mana pandangan peserta boleh tidak dihiraukan. Agensi meminta 
pandangan input peserta mendapat 39.8 peratus persetujuan responden. Manakala dalam perkara kurang 
kawalan peserta pula, 22.4 peratus peserta tidak bersetuju dengan perkara ini. Perkara perkongsian 
maklumat sehala iaitu tidak perlu terima pandangan peserta turut tidak dipersetujui oleh responden peserta 
31.6 peratus. Bagi merujuk kepada skor nilai min pula, perkara pandangan input peserta mengenai projek 
adalah pada tahap tinggi iaitu 2.39. Manakala kurang kawalan peserta dan perkongsian maklumat sehala 
adalah pada tahap sederhana, masing-masing 1.9 dan 1.86. Ini menunjukkan bahawa, hanya pandangan 
input peserta berada pada tahap tinggi (2.34 hingga 3.00), manakala dua perkara yang lain berada pada 
tahap sederhana sahaja (1.67 hingga 2.33). Namun begitu, purata skor nilai min untuk penglibatan melalui 
perundingan adalah pada tahap sederhana. 
Seterusnya, penglibatan bermotivasikan pulangan material yang diperlukan penduduk merupakan 
tahap penyertaan yang dikaji. Penglibatan ini bermaksud peserta menawarkan sumber dalam bentuk tenaga 
buruh dan tanah bagi mendapatkan pulangan dalam bentuk material atau wang atau insentif kebendaan. 
Tambahan itu, peserta tidak didedahkan kemahiran baru yang bermanfaat pada masa hadapan sekiranya 
projek selesai. Hasil menunjukkan bahawa responden bersetuju dengan perkara peserta tawar sumber 
(tenaga buruh dan tanah) bagi mendapatkan pulangan material atau wang atau insentif kebendaan sebanyak 
55.1 peratus. Ini turut disokong oleh skor nilai min di mana ia pada tahap tinggi 2.4. Manakala perkara 
peserta tidak didedahkan kemahiran baru yang bermanfaat pada masa hadapan oleh penduduk sekiranya 
projek selesai hanya mendapat persetujuan 38.8 peratus responden sahaja. Skor nilai min turut menyatakan 
bahawa perkara ini adalah pada tahap sederhana iaitu 2.15. Manakala purata skor nilai min adalah pada 
tahap sederhana.  
Penglibatan berfungsi bermaksud peserta dilibatkan dalam projek hanya setelah keputusan dibuat 
oleh pakar luar. Tambahan pula penglibatan peserta dilihat membantu mencapai matlamat projek dan 
peserta turut terlibat dalam membuat keputusan dalam hubungan dua hala dengan pihak berkuasa. Hasil ini 
merangkumi keputusan penting dibuat oleh pakar luar, peserta hanya membantu mencapai matlamat projek 
dan peserta turut terlibat dalam membuat keputusan bagi sesetengah perkara. Bagi perkara membantu 
mencapai matlamat projek, 57.1 peratus responden bersetuju mengenai perkara ini. Keputusan ini turut 
disokong oleh skor nilai min di mana perkara bawah penglibatan berfungsi iaitu bantu capai matlamat projek 
dan turut membuat keputusan adalah pada tahap tinggi 2.34 hingga 3.00. Bagi perkara keputusan penting 
oleh pakar luar pula adalah pada tahap sederhana, nilai min 2.1. Walau bagaimanapun, purata skor nilai min 
penglibatan berfungsi adalah pada tahap tinggi.  
Penglibatan melalui perundingan, penglibatan bermotivasikan pulangan material yang diperlukan 
oleh penduduk dan penglibatan berfungsi adalah sama dengan ciri-ciri yang dikemukakan dalam hierarki 3, 
Model Arnstein (1969) iaitu penglibatan melalui pemberitahuan /makluman. Hasil kajian menunjukkan 
bahawa penglibatan adalah terletak peringkat amalan tanda (tokenism) dalam Model Arnstein di mana 
18 
 Kualiti Hidup Peserta Program Ladang Kontrak 
 di Bawah Pertubuhan Peladang Kawasan 
 
pandangan dan input peserta diminta dalam membuat keputusan.  
Perkara seterusnya adalah penglibatan interaktif. Penglibatan interaktif bermaksud penglibatan 
peserta dalam projek adalah hak dan bukan sekadar objek mencapai matlamat. Peserta dikatakan dilibatkan 
dalam proses perancangan dan membuat keputusan dan kaedah pembelajaran yang menggunakan 
pendekatan pelbagai bidang yang sistematik. Selain itu, peserta mempunyai kawalan yang signifikan ke atas 
projek. Hasil kajian menunjukkan bahawa kebanyakan responden bersetuju bahawa peserta mempunyai hak 
dan bukan sebagai objek mencapai matlamat, terlibat dalam proses perancangan dan keputusan, pendekatan 
pelbagai bidang dan kaedah pembelajaran dan kawalan signifikan ke atas projek. Masing-masing 
memberikan bacaan peratusan responden 54.1 peratus, 56.1 peratus, 57.1 peratus dan 57.1 peratus. Hasil 
kajian ini turut disokong keputusan skor nilai min bagi kesemua perkara di bawah penglibatan interaktif 
adalah pada tahap tinggi (2.34 hingga 3.00). Manakala purata skor nilai min adalah pada tahap tinggi. Ini 
secara tidak langsung menyatakan peserta bersetuju bahawa mereka mempunyai hak dan bukan objek 
mencapai matlamat, terlibat dalam proses perancangan dan membuat keputusan, pendekatan pelbagai 
bidang dan kaedah pembelajaran dan kawalan signifikan ke atas projek.  
Penglibatan pergerakan sendiri merupakan perkara terakhir yang dikaji di bawah tahap penyertaan 
peserta PPK, ia merangkumi tanpa bergantung pada institusi luar, jalin hubungan dengan agensi luar, dan 
penglibatan dicapai dengan bantuan pihak kerajaan/NGO. Penglibatan pergerakan sendiri bermaksud 
peserta mempunyai inisiatif dalam melaksanakan projek pembangunan tanpa bergantung kepada institusi 
luar dan peserta menjalin hubungan dengan agensi luar dalam mendapatkan sumber dan nasihat teknikal 
tetapi mempunyai kawalan penuh ke atas sumber. Tambahan penglibatan ini boleh dicapai sekiranya pihak 
kerajaan atau NGO memberi bantuan dan sokongan kepada peserta. Hasil dapatan menunjukkan 72.4 
peratus responden bersetuju penglibatan ini boleh dicapai sekiranya pihak kerajaan atau NGO memberi 
bantuan dan sokongan. Seterusnya 64.3 peratus responden bersetuju dengan perkara peserta mempunyai 
inisiatif dalam melaksanakan projek pembangunan tanpa bergantung pada institusi luar bersetuju dengan 
pembangunan tanpa gantung institusi luar. Akhirnya 63.3 peratus peserta bersetuju bahawa peserta menjalin 
hubungan dengan agensi luar dalam mendapatkan sumber dan nasihat teknikal tetapi mempunyai kawalan 
penuh ke atas penggunaan sumber. Hasil kajian ini turut disokong skor nilai min kesemua perkara yang 
dikaji adalah pada tahap tinggi 2.34 hingga 3.00, masing-masing 2.62 (tanpa gantung institusi luar), 2.62 
(jalin hubungan agensi luar) dan 2.71 (dicapai dengan bantuan pihak kerajaan/NGO). Tambahan pula purata 
skor nilai min adalah pada tahap tinggi.  
Kedua-dua penglibatan interaktif dan penglibatan pergerakan sendiri dalam Tipologi Pretty adalah 
sama dengan peringkat kuasa komuniti (citizen power) dalam model Arnstein -penglibatan secara 
kerjasama/usaha sama, penglibatan secara pembahagian kuasa dan penglibatan penuh (kawalan sepenuhnya 
oleh komuniti). Penglibatan-penglibatan adalah pada tahap purata skor nilai min yang tinggi. Ini secara 
tidak langsung menunjukkan bahawa peserta program ladang kontrak adalah pada peringkat yang paling 
akhir tangga Model Arnstein yang bermaksud penglibatan peserta dalam projek adalah hak dan bukan 
sekadar objek mencapai matlamat, peserta terlibat dalam proses perancangan dan membuat keputusan, 
pembelajaran pelbagai bidang dan sistematik dan peserta mempunyai kawalan signifikan ke atas projek 
yang dilaksanakan. Tambahan pula, peserta dikatakan mempunyai inisiatif dalam melaksanakan projek 
pembangunan tanpa bergantung kepada institusi luar, peserta menjalin hubungan dengan agensi luar dalam 
mendapatkan sumber dan nasihat teknikal tetapi mempunyai kawalan penuh ke atas penggunaan sumber 
serta penglibatan ini dapat dicapai dengan adanya sokongan jabatan/agensi atau NGO seperti apa yang 
dilaksanakan kerajaan sekarang.  
KESIMPULAN  
Hasil kajian menunjukkan bahawa PPK bawah program ladang kontrak ternyata dapat meningkatkan kualiti 
hidup peserta dari aspek pendapatan dan pengagihan, pendidikan, kesihatan dan keluarga dengan 
sumbangan-sumbangan PPK yang dikenal pasti iaitu meningkatkan pendapatan, menjamin pasaran, 
penyertaan pekebun kecil, mengurangkan kos perniagaan, meningkatkan kualiti produk, lebih kuasa tawar-
menawar, menjamin pulangan, menyasar pasaran khusus dan pengumpulan aset produktif berada di dalam 
lingkungan 82.7 peratus hingga 91.8 peratus. Ini telah menunjukkan bahawa PPK dapat membantu peserta 
program ladang kontrak dalam mencapai kualiti hidup yang disasarkan kerajaan. Sementara itu, tahap 
penyertaan peserta PPK di bawah program ladang kontrak boleh dikatakan pada tahap penglibatan akar 
umbi dan agak memberangsangkan. Penglibatan yang berada pada tahap tinggi adalah penglibatan 
19 
 Geografi Vol. (5), No. (2) Special Issue, (2017), 8-22 
     © Penerbit Universiti Pendidikan Sultan Idris 2017 
      ISSN 2289-4470 /eISSN 2462-2400 
Focus editor special issue - Dr Rosniza Aznie Che Rose 
 
berfungsi, penglibatan interaktif dan penglibatan pergerakan sendiri. Ini sejajar dengan peringkat kuasa 
komuniti (citizen power) dalam Model Arnstein di mana peserta mempunyai kuasa penuh ke atas 
penglibatan. Manakala penglibatan yang berada pada tahap sederhana adalah penglibatan manipulatif, 
penglibatan pasif, penglibatan melalui perundingan dan penglibatan bermotivasikan pulangan material yang 
diperlukan oleh penduduk. Ini menunjukkan tahap penyertaan peserta PPK adalah tinggi di kawasan kajian 
dan peserta PPK di bawah program ladang kontrak telah memberi kesan yang positif ke atas kualiti hidup 
peserta.  
Lanjutan daripada itu, dengan memahami sumbangan PPK dan tahap penyertaan peserta PPK di 
kawasan kajian, Kementerian Pertanian dan Industri Asas Tani serta jabatan/agensi di bawahnya dapat 
melakukan penambahbaikan dalam memastikan pelaksanaan program ladang kontrak ini benar-benar 
mencapai sasaran dan golongan sasaran. Cadangan kajian untuk kajian akan datang boleh dikaji berdasarkan 
sumbangan PPK di bawah program ladang kontrak adalah perubahan sebelum menyertai dan selepas 
menyertai PPK bagi memperkukuhkan lagi sumbangan-sumbangan yang telah dikenal pasti. Selain itu, 
kajian ini hanya bertumpu di negeri Selangor Darul Ehsan. Oleh itu, kajian di seluruh Malaysia boleh 
dilaksanakan bagi memperoleh hasil yang lebih menyeluruh. Di samping itu, kajian mengenai faktor 
globalisasi, faktor kelestarian turut boleh dilaksanakan ke atas program ladang kontrak bagi menguatkan 
lagi kelestarian program ini.  
RUJUKAN 
Alene, A. D., Manyong, V. M., Omanya, G., Mignouna, H. D., Bokanga, M. & Odhiambo, G. (2008). Smallholder 
 market participation under transactions costs: Maize supply and fertilizer demand in Kenya. Food Policy, 33(4), 
 318–328. Diperoleh daripada doi:10.1016/j.foodpol.2007.12.001 
Amriah Buang & Ratnawati Yuni Suryandari. (2009). Pertanian kontrak sebagai satu kaedah memajukan petani 
 kecil Melayu : Tanggapan dan penilaian komuniti tani tempatan di zon utara, Semenanjung Malaysia prestasi
 program Pertanian Kontrak FAMA. Malaysia Journal of Society and Space, 5(1), 11–22. 
Amriah Buang, Mohd Azlan Abdullah & Rosmiza Mohd Zainol. (2010). Memajukan petani kecil Melayu menerusi 
 Pertanian Kontrak - Persepsi dan penilaian peserta projek dan komuniti tempatan. Geografia - Malaysian Journal 
 of Society and Space, 6(1), 68–80. Diperoleh daripada http://www.ukm.my/geografia 
Arnstein, S. R. (1969). A ladder of citizen participation. Journal of American Institute of Planners (JAIP), 35(4), 
  216–224. 
Arumugam, N., Fatimah, M. A., Chiew, E. F. C. & Zainalabidin, M. (2010). Supply chain analysis of fresh fruits and 
 vegetables (FFV): Prospects of contract farming. Agricultural Economic, 56(9), 435–442. Diperoleh daripada 
 http://psasir.upm.edu.my/11379/ 
Azahan Awang, Abdul Hadi Harman Shah & Kadaruddin Aiyub. (2008). Penilaian makna kualiti hidup dan 
 aplikasinya dalam bidang pengurusan persekitaran di Malaysia. Akademika, 72, 45–68. Diperoleh daripada 
 http://pkukmweb.ukm.my/~penerbit/akademika/jademik.html   
Azahan Awang, Abdul Samad Hadi, Jamaluddin Md. Jahi, Asmah Ahmad & Abdul Hadi Harman Shah. (2006). 
 Mendefinisi semula makna kualiti hidup masyarakat bandar dalam konteks ilmu sosial. Malaysian Journal of 
 Environmental Management, 7, 19–32. 
Bahagian Pemasaran dan Eksport, Kementerian Pertanian dan Industri Asas Tani. (2006). Programme Charter 
 Program Ladang Kontrak. Tidak diterbitkan. 
Barrett, C. B., Bachke, M. E., Bellemare, M. F., Michelson, H. C., Narayanan, S. & Walker, T. F. (2011). 
 Smallholder  Participation in Contract Farming : Comparative Evidence from Five Countries. World 
 Development (revised  version): 47. 
Baumann, P. (2000). Equity and efficiency in contract farming schemes: The experience of agricultural tree 
 crops. Working Paper 139. Overseas Development Institute, London. London. Diperoleh daripada 
 http://www.odi.org/sites/odi.org.uk/files/odi-assets/publications-opinion-files/2730.pdf 
Bellemare, M. F. (2010). As you sow, so shall you reap: The welfare impacts of contract farming. Munich Personal 
 RePEc Archive (MPRA) 52. 
Belt, R. van de. (2011). It’s more than the economy, stupid. Economic Research Department. Netherlands: 
 Rabobank. Diperoleh daripada http://search.ebscohost.com/login.aspx?direct=true&db=a9h&AN 
 =10522611&site=ehost-live 
Coulter, J., Goodland, A., Tallontire, A. & Stringfellow, R. (1999). Marrying farmer cooperation and contract 
 farming for service provision In a Liberalising Sub-Saharan Africa. ODI Natural Resource Perspectives, 
 1(48), 1–4. 
20 
 Kualiti Hidup Peserta Program Ladang Kontrak 
 di Bawah Pertubuhan Peladang Kawasan 
 
Glover, D. & Kusterer, K. (1990). Small farmers, big business - contract farming and rural development. Macmillan 
 International Political Economy Series. England: MacMillan Distribution Ltd. 
Haslina Hashim & Garai Abdullah Regina. (2009). Penglibatan komuniti dalam program pembangunan luar bandar:  
 Kajian kes di Pusat Pertumbuhan Desa Gedong, Sarawak. Akademika, 77, 41–67. Diperoleh daripada 
 http://pkukmweb.ukm.my/~penerbit/akademika/jademik.html 
Hayward, F. (1979). Perceptions of well-being in Ghana: 1970 and 1975. African Studies Review, 22(1), 109–125. 
 Diperoleh daripada http://journals.cambridge.org/abstract_S0002020600018758 
Jabatan Perdana Menteri. (2004). Kualiti Hidup Malaysia 2004. Jabatan Perdana Menteri. 
Hamilton, N.D. (2008). Agricultural contracting: A United States perspective and issues for India to consider. Dlm 
 A. Gulat, P.K. Joshi and M. Landes (eds.). Contract Farming in India: A Resource Book. 
Izham M. Yusoff, Wan Rozali W.  Hussin, Fatimah Hassan, Nurwati Badarulzaman, Mohamed Z. Omar & Main 
 Rindam. (2012). Improving the quality of social life: A case study in FELDA Trolak Group, Perak Darul 
 Ridzuan, Malaysia. Perspektif, 4(2), 99-113. 
Katiman Rostam. (2013). Cultural deprivation: It’s impact on the environment and man. Geografi, 1(1), 23-47. 
 Diperoleh daripada https://ejournal.upsi.edu.my/GetFinalFile.ashx?file=d3e3e11d-a9a4-4ea2-901b-
 7b62a6eae59e.pdf 
Kaur, B., Kamarulzaman, N. H., & Hamzah, N. A. (2015). The impact of public-assisted contract farming 
 programmes  in Malaysia. Journal of Agribusiness Marketing, 7, 1–15. 
Kementerian Pertanian dan Industri Asas Tani. (2017). Projek berimpak besar. Diperoleh daripada 
 http://www.moa.gov.my/web/guest/projek-berimpak-besar [20 April 2017]. 
Kementerian Pertanian dan Industri Asas Tani Malaysia. (2016). Mesyuarat Jawatan Kuasa Pemandu Ladang 
  Kontrak MOA. Tidak diterbitkan. 
Key, N., & Runsten, D. (1999). Contract farming, smallholders, and rural development in Latin America : The 
 organization of agroprocessing firms and the scale of outgrower production. World Development, 27(2), 381–
 401. 
Krejcie, R. V., & Morgan, D. W. (1970). Determining sample size for research activities. Educational and 
 Psychological  Measurement, 30(3), 607–610. Diperoleh daripada 
 http://opa.uprrp.edu/InvInsDocs/KrejcieandMorgan.pdf 
Lembaga Pemasaran Pertanian Persekutuan (FAMA). (2012). Kertas kerja lisan Confertech oleh FAMA. Tidak 
 diterbitkan. 
Lembaga Pertubuhan Peladang. (2017). Farmers organization-introduction.  Diperoleh daripada 
http://www.lpp.gov.my/farmers-organization-
introduction;jsessionid=184DE3C739C4F50AE568B62380B229BC [12 April 2017]. 
Minot, N. (1986). Contract farming and its effect on small farmers in less developed countries. Working paper No. 
  31.Michigan State University. East Lansing, Michigan, USA. Diperoleh daripada 
 http://ideas.repec.org/p/ags/midiwp/54740.html 
Minot, N., & Sawyer, B. (2016). Contract farming in developing cuuntries : Theory, practice, and policy implication.
 Washington, D.C.: International Food Policy Research Institute (IFPRI). 
Miyata, S., Minot, N., & Hu, D. (2009). Impact of contract farming on income: Linking small farmers, packers, 
 and  supermarkets in China. World Development, 37(11), 1781–1790. Diperoleh daripada 
 doi:10.1016/j.worlddev.2008.08.025 
Mohd Shaladdin Muda & Nik Wan Omar. (2006). Model peramal kepuasan kerja pegawai perkhidmatan pendidikan 
 di  komuniti pesisir Terengganu. IJMS, 13(Special Issue), 123–142. 
Muhammad Rizal Razman, Sakina Shaik Ahmad Yusoff, Shamsuddin Suhor, Rahmah Ismail, Azimon Abdul Aziz & 
Kartini Aboo Talib @ Khalid. (2011). Environmental protection towards freshwater resources for consumer quality 
of life with tort laws: Special focus on negligency. Jurnal Perspektif, 3(2), 1-11.  
Morgan, M. (2006). Applying a gender lens to katalyst market development activities. 
Morrison, P. S., Murray, W. E., & Ngidang, D. (2006). Promoting indigenous entrepreneurship through small-scale 
 contract farming: The poultry sector in Sarawak, Malaysia. Singapore Journal of Tropical Geography, 27(2), 
 191–206. Diperoleh daripada doi:10.1111/j.1467-9493.2006.00253.x 
Mowforth, M., & Munt, I. (1998). Tourism and sustainability: New tourism in the Third World. New York: 
 Routledge.  Diperoleh daripada doi: 10.1177/1938965510362871 
Nor Malina Malek, Mohamad Shaharudin Samsurijan, Khoo Suet Leng, Parthiban S. Gopal, Zahri Hamat. (2017). 
 Kemampuan memiliki rumah dalam kalangan keluarga bandar di Malaysia. Geografi, 5(2), 69-77. Diperoleh 
 daripada  https://ejournal.upsi.edu.my/GetFinalFile.ashx?file=f14ddbaa-e2e9-4b7a-b756-b7c620e80242.pdf 
Norizan Abdul Ghani. (2003). Kualiti hidup penduduk pulau Negeri Terengganu: Satu kajian di Pulai Redang dan 
 Pulau Perhentian. Kolej Universiti Sains dan Teknologi Malaysia. 
Othman Talib. (2013). Asas penulisan tesis, penyelidikan statistik. Serdang: Penerbit Universiti Putra Malaysia.  
Pretty, J. N. (1995). Participatory learning for sustainable agriculture. World Development, 23(8), 1247–1263. 
 Diperoleh daripada doi: 10.1016/0305-750X (95) 00046-F 
21 
 Geografi Vol. (5), No. (2) Special Issue, (2017), 8-22 
     © Penerbit Universiti Pendidikan Sultan Idris 2017 
      ISSN 2289-4470 /eISSN 2462-2400 
Focus editor special issue - Dr Rosniza Aznie Che Rose 
 
Prowse, M. (2012). Contract farming in developing countries - A review contract. Paris: Frech Development Agency 
 (Agence Française de Dévelopement). 
Ramaswami, B., Birthal, P. S., & Joshi, P. (2005). Efficiency and distribution in contract farming : The case 
 Indian poultry growers. Discussion Papers in Economics, 1, 1–39. 
Rani, B. N. S. (2000). Globalization and contract farming in India-Advantages and problems. Conference on Global 
 Competition & Competitiveness of Indian Corporate, pp 637–647. 
Rao, E.J.O. & Qaim, M. (2010). Supermarkets, farm household income and poverty: Insights from Kenya. Joint 3rd 
 African Association of Agricultural Economists and 48th Agricultural Economists Association of South Africa 
 Conference, hlm. 1–36. Germany: German Research Foundation (DFG). 
Sarmila, M. S., Ramli, Z., Lyndon, N., Azima, A. M., Suhana, S., Aznie, R. & Selvadurai, S. (2014). Pembangunan 
 usaha tani melalui inisiatif tanggungjawab sosial korporat (CSR): Satu kajian kes. Malaysian Journal of Society 
 and  Space, 10(3), 134–147. Diperoleh daripada http://www.ukm.my/geografia/v2/index.php 
Sarmila, M. S., Zaimah, R., Lyndon, N., Azima, A. M., Suhana, S., & Aznie, C. R. R. (2015). Tanggungjawab Sosial 
 Korporat (CSR) dan pembangunan modal sosial komuniti : Kajian kes projek CSR perladangan cili kontrak. 
 Geografia, 11(7), 104–115. 
Simmons, P., Winters, P. & Patrick, I. (2005). An analysis of contract farming in East Java, Bali, and Lombok, 
 Indonesia. Agricultural Economics, 33(3), 513–525. Diperoleh daripada doi 10.1111/j.1574-0864.2005.00096.x 
Sokchea, A. & Culas, R. J. (2015). Impact of contract farming with farmer organizations on farmers’ income: A case 
 study of Reasmey Stung Sen Agricultural Development Cooperative in Cambodia. Australasian Agribusiness 
 Review, 23, 1–11. 
Unit Perancang Ekonomi Jabatan Perdana Menteri. (2013). Laporan Kesejahteraan Rakyat Malaysia 2013. 
 Putrajaya, Malaysia. 
Yusof, A. M., Ali, J., & Kamarudin, R. (2013). Kesejahteraan hidup: Kajian petani di kawasan penanaman padi di 
 Negeri Perlis. Prosiding Perkem VIII, 3, 7–9. 
Yusrizal, A. (2013). Kualiti hidup dan hubungannya dengan kualiti perkhidmatan serta kepuasan pelanggan: Satu 
 kajian ke atas peserta Program Ladang Kontrak. (Tesis Sarjana). Tidak diterbitkan. Universiti Utara Malaysia. 
Warning, M. & Key, N. (2002). The social performance and distributional consequences of contract farming: An 
 equilibrium analysis of the Arachide De Bouche program in Segenal. World Development, 30(2), 255-263. 
22 
 